In [141]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [142]:
dic = {'name':(['rob','rafiq','nina','sofia','mohan','tao','Elon musk']),
       'income':[5000,6000,4000,7500,8000,7000,10000000]}

In [143]:
df =pd.DataFrame(dic)

In [144]:
df

        name    income
0        rob      5000
1      rafiq      6000
2       nina      4000
3      sofia      7500
4      mohan      8000
5        tao      7000
6  Elon musk  10000000

In [145]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [146]:
df.income.quantile(0.75)

7750.0

In [147]:
percentile =df["income"].quantile(0.90)

In [148]:
df_no_outlier = df[~(df["income"] > percentile)]
df_no_outlier

    name  income
0    rob    5000
1  rafiq    6000
2   nina    4000
3  sofia    7500
4  mohan    8000
5    tao    7000

In [149]:
df['income'][3]= np.NaN

In [150]:
df

        name      income
0        rob      5000.0
1      rafiq      6000.0
2       nina      4000.0
3      sofia         NaN
4      mohan      8000.0
5        tao      7000.0
6  Elon musk  10000000.0

In [151]:
df_new = df.fillna(df['income'].median())

In [152]:
df_new

        name      income
0        rob      5000.0
1      rafiq      6000.0
2       nina      4000.0
3      sofia      6500.0
4      mohan      8000.0
5        tao      7000.0
6  Elon musk  10000000.0

# Excersize:

remove outlier and errors from the air Bnb data set

In [153]:
df = pd.read_csv('AB_NYC_2019.csv')

In [154]:
df.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,2539,Clean & quiet apt home by the park,2787,John,Brooklyn,Kensington,40.64749,-73.97237,Private room,149,1,9,2018-10-19,0.21,6,365
1,2595,Skylit Midtown Castle,2845,Jennifer,Manhattan,Midtown,40.75362,-73.98377,Entire home/apt,225,1,45,2019-05-21,0.38,2,355
2,3647,THE VILLAGE OF HARLEM....NEW YORK !,4632,Elisabeth,Manhattan,Harlem,40.80902,-73.94190,Private room,150,3,0,NaN,NaN,1,365
3,3831,Cozy Entire Floor of Brownstone,4869,LisaRoxanne,Brooklyn,Clinton Hill,40.68514,-73.95976,Entire home/apt,89,1,270,2019-07-05,4.64,1,194
4,5022,Entire Apt: Spacious Studio/Loft by central park,7192,Laura,Manhattan,East Harlem,40.79851,-73.94399,Entire home/apt,80,10,9,2018-11-19,0.10,1,0

In [155]:
df.reviews_per_month.max()

58.5

In [156]:
df.isnull().sum()

id                                    0
name                                 16
host_id                               0
host_name                            21
neighbourhood_group                   0
neighbourhood                         0
latitude                              0
longitude                             0
room_type                             0
price                                 0
minimum_nights                        0
number_of_reviews                     0
last_review                       10052
reviews_per_month                 10052
calculated_host_listings_count        0
availability_365                      0
dtype: int64

In [157]:
df.describe()

,id,host_id,latitude,longitude,price,minimum_nights,number_of_reviews,reviews_per_month,calculated_host_listings_count,availability_365
count,4.889500e+04,4.889500e+04,48895.000000,48895.000000,48895.000000,48895.000000,48895.000000,38843.000000,48895.000000,48895.000000
mean,1.901714e+07,6.762001e+07,40.728949,-73.952170,152.720687,7.029962,23.274466,1.373221,7.143982,112.781327
std,1.098311e+07,7.861097e+07,0.054530,0.046157,240.154170,20.510550,44.550582,1.680442,32.952519,131.622289
min,2.539000e+03,2.438000e+03,40.499790,-74.244420,0.000000,1.000000,0.000000,0.010000,1.000000,0.000000
25%,9.471945e+06,7.822033e+06,40.690100,-73.983070,69.000000,1.000000,1.000000,0.190000,1.000000,0.000000
50%,1.967728e+07,3.079382e+07,40.723070,-73.955680,106.000000,3.000000,5.000000,0.720000,1.000000,45.000000
75%,2.915218e+07,1.074344e+08,40.763115,-73.936275,175.000000,5.000000,24.000000,2.020000,2.000000,227.000000
max,3.648724e+07,2.743213e+08,40.913060,-73.712990,10000.000000,1250.000000,629.000000,58.500000,327.000000,365.000000

In [158]:
# max_thresh = df["price"].quantile(0.95)
# min_thresh = df["price"].quantile(0.05)
# new_df = df[(df['price']> min_thresh)& (df["price"] < max_thresh)]

In [159]:
new_df =df.copy()

In [160]:
def new_data(col_name , new_df):
    max_thresh = new_df[col_name].quantile(0.9999)
    min_thresh = new_df[col_name].quantile(0.01)
    new_df = new_df[(new_df[col_name]> min_thresh)& (new_df[col_name] < max_thresh)]
    return new_df
             
df_price = new_data("price", new_df)
df_minimum_nights= new_data("minimum_nights" ,df_price)
df_number_of_reviews=new_data("number_of_reviews",df_minimum_nights)
# df_reviews_per_month=new_data("reviews_per_month", df_number_of_reviews)
df_calculated_host_listings_count=new_data("calculated_host_listings_count", df_number_of_reviews)

df_no_outlier = df_calculated_host_listings_count

In [161]:
df_price.shape

(48230, 16)

In [162]:
df_minimum_nights.shape

(35752, 16)

In [163]:
df_number_of_reviews.shape

(28631, 16)

In [164]:
df_reviews_per_month.shape

(28082, 16)

In [165]:
df_calculated_host_listings_count.shape

(8867, 16)

In [166]:
df_no_outlier.shape

(8867, 16)

In [167]:
df_no_outlier.isnull().sum()

id                                0
name                              0
host_id                           0
host_name                         2
neighbourhood_group               0
neighbourhood                     0
latitude                          0
longitude                         0
room_type                         0
price                             0
minimum_nights                    0
number_of_reviews                 0
last_review                       0
reviews_per_month                 0
calculated_host_listings_count    0
availability_365                  0
dtype: int64